'''
Вычислите |x|+x5, если x=−2.
'''

x = -2
print(abs(x) + (x ** 5))