'''
Дано число. Если оно больше 3, то увеличить число на 10, иначе уменьшить на 10.
'''

num = int(input('Введите число: '))
if num > 3:
    print(num + 10)
else:
    print(num - 10)
