# Вычислите |x|+x5, если x=−2.

x = 2 # отрицательный модуль числа равен самому числу
print(x + (x ** 5))