'''
Пользователь вводит три числа. Найдите среднее арифметическое этих чисел,
а также разность удвоенной суммы первого и третьего чисел и утроенного второго числа.
'''

numbers = input('Введите три числа через пробел: ').split(' ')
print(numbers)