'''
Вычислите |x|+x5, если x=−2.
'''

x = abs(-2) # отрицательный модуль числа
print(x + (x ** 5))