'''
Дано значение температуры в градусах Цельсия. Вывести температуру  в градусах Фаренгейта.
'''

print(round((int(input('Введите значения градусов по Цельсию: ')) * 1.8 + 32)))