# Вычислите 1/2+1/4. Ответ: 0.75

print((1/2) + (1/4))