'''
Вычислите значение выражения (x+1)2+3(x+1) при а) x=1.7; б) x=3. Ответ: а) 15.39 б) 28
'''

x1, x2 = 1.7, 3
print(round(((x1 + 1) ** 2) + 3 * (x1 + 1), ndigits=2))
print(((x2 + 1) ** 2) + 3 * (x2 + 1))




