'''
Выведите на экран 10 раз фразу "You are welcome!"
'''

for sentence in range(1, 11):
    print('You are welcome!', sentence)
