'''
Дано пятизначное число. Цифры на четных позициях занулить.
Например, из 12345 получается число 10305.
'''

nums = list(input('Введите пятизначное число: '))

if int(nums[0]) % 2 == 0:
    nums[0] = '0'
if int(nums[1]) % 2 == 0:
    nums[1] = '0'
if int(nums[2]) % 2 == 0:
    nums[2] = '0'
if int(nums[3]) % 2 == 0:
    nums[3] = '0'
if int(nums[4]) % 2 == 0:
    nums[4] = '0'

print(''.join(nums))

